{"_id":{"$oid":"65de16569577bc2b6e8413bb"},"Title":"The Farewell","Description":"A Chinese family discovers their grandmother has only a short while left to live and decide to keep her in the dark, scheduling a wedding to gather before she dies.","Genre":{"Name":"Drama","Description":"A genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"Lulu Wang","Bio":"Lulu Wang was born February 25, 1983 and is a Chinese-born American filmmaker. She is best known for writing and directing the comedy-drama films Posthumous (2014) and The Farewell (2019). For the latter, she received the Independent Spirit Award for Best Film and the film was named one of the top ten films of 2019 by the American Film Institute. Wang has also written, produced, and directed several short films, documentaries, and music videos.","Birth":1983},"ImageURL":"https://images.app.goo.gl/Tn4jRnSP5xyXZqTP9","Featured":false}
{"_id":{"$oid":"65de16719577bc2b6e8413bc"},"Title":"Mulan","Description":"To save her father from death in the army, a young maiden secretly goes in his place and becomes one of China's greatest heroines in the process.","Genre":{"Name":"Action","Description":"A genre featuring characters involved in exciting and usually dangerous activities and adventures."},"Director":{"Name":"Tony Bancroft","Bio":"Tony Bancroft is an American animator and film director who frequently collaborates with Disney. He is the founder and owner of the faith-driven animation company Toonacious Family Entertainment. Tony is the Executive VP Creative Development and Production for DivideNine Animation Studios.","Birth":1967},"ImageURL":"https://images.app.goo.gl/s9DcrURzwNYdtdNs8","Featured":false}
{"_id":{"$oid":"65de16be9577bc2b6e8413bd"},"Title":"The Ring","Description":"A journalist must investigate a mysterious videotape which seems to cause the death of anyone one week to the day after they view it.","Genre":{"Name":"Horror","Description":"A film in which very frightening or unnatural things happen."},"Director":{"Name":"Gore Verbinski","Bio":"Gregor Justin 'Gore' Verbinski (born March 16, 1964) is an American film director. He is best known for directing Mouse Hunt, The Ring, the first three Pirates of the Caribbean films, and Rango. For his work on Rango, Verbinski won both the Academy Award and BAFTA Award for Best Animated Film.","Birth":1964},"ImageURL":"https://images.app.goo.gl/LZHn2QXMAcF7qcmz5","Featured":false}
{"_id":{"$oid":"65de17099577bc2b6e8413be"},"Title":"Mean Girls","Description":"Cady Heron is a hit with The Plastics, the A-list girl clique at her new school, until she makes the mistake of falling for Aaron Samuels, the ex-boyfriend of alpha Plastic Regina George.","Genre":{"Name":"Comedy","Description":"A comedy film is a category of film that emphasizes humor. These films are designed to amuse audiences and make them laugh. Films in this genre typically have a happy ending, with dark comedy being an exception to this rule. Comedy is one of the oldest genres in film, and it is derived from classical comedy in theatre."},"Director":{"Name":"Mark Waters","Bio":"Mark Waters grew up in South Bend, Indiana, USA. His first film, The House of Yes, debuted at the Sundance Film Festival in 1997. He is a director and producer, known for Mean Girls (2004), 500 Days of Summer (2009) and He's All That (2021).","Birth":1964},"ImageURL":"https://images.app.goo.gl/8gQ3QDBNjBynvRk97","Featured":false}
{"_id":{"$oid":"65de17459577bc2b6e8413bf"},"Title":"Sordid Lives","Description":"As three generations of a family in a small Texas town gather for a funeral, we learn the hilarious, sad, trashy truth of their Sordid Lives.","Genre":{"Name":"Comedy","Description":"A comedy film is a category of film that emphasizes humor. These films are designed to amuse audiences and make them laugh. Films in this genre typically have a happy ending, with dark comedy being an exception to this rule. Comedy is one of the oldest genres in film, and it is derived from classical comedy in theatre."},"Director":{"Name":"Del Shores","Bio":"Delferd Lynn Shores is an American film director, television writer, producer, playwright, standup comedian, and actor. He has written, directed and produced across studio and independent film, network and cable television and Los Angeles, regional and national touring theatre.","Birth":1957},"ImageURL":"https://images.app.goo.gl/GsBxCF1yRjpXVEH9A","Featured":false}
{"_id":{"$oid":"65de17ec9577bc2b6e8413c0"},"Title":"Dan in Real Life","Description":"A widower finds out the woman he fell in love with is his brother's girlfriend.","Genre":{"Name":"Drama","Description":"A genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"Peter Hedges","Bio":"Peter Simpson Hedges (born July 6, 1962) is an American novelist, playwright, screenwriter, film director and film producer.","Birth":1962},"ImageURL":"https://images.app.goo.gl/ACVmQ81cJ8wCu9Zs5","Featured":false}
{"_id":{"$oid":"65de18179577bc2b6e8413c1"},"Title":"Weekend","Description":"After a drunken house party with his straight mates, Russell heads out to a gay club. Just before closing time he picks up Glen but what's expected to be just a one-night stand becomes something else, something special.","Genre":{"Name":"Drama","Description":"A genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"Andrew Haigh","Bio":"Andrew Haigh is an English filmmaker. He is best known for writing and directing the films Weekend, 45 Years, Lean on Pete, and All of Us Strangers. He also wrote and produced the HBO series Looking and its film sequel Looking: The Movie, as well as the BBC Two limited series The North Water.","Birth":1973},"ImageURL":"https://images.app.goo.gl/rJ2To1tiVnhQMCzm7","Featured":false,"Bio":"Andrew Haigh is an English filmmaker. He is best known for writing and directing the films Weekend, 45 Years, Lean on Pete, and All of Us Strangers. He also wrote and produced the HBO series Looking and its film sequel Looking: The Movie, as well as the BBC Two limited series The North Water. He splits his time between the U.K. and Los Angeles."}
{"_id":{"$oid":"65de18359577bc2b6e8413c2"},"Title":"All of Us Strangers","Description":"A screenwriter drawn back to his childhood home enters into a fledgling relationship with a mysterious neighbor as he then discovers his parents appear to be living just as they were on the day they died, 30 years before.","Genre":{"Name":"Drama","Description":"A genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"Andrew Haigh","Bio":"Andrew Haigh is an English filmmaker. He is best known for writing and directing the films Weekend, 45 Years, Lean on Pete, and All of Us Strangers. He also wrote and produced the HBO series Looking and its film sequel Looking: The Movie, as well as the BBC Two limited series The North Water.","Birth":1973},"ImageURL":"https://images.app.goo.gl/NNYtvwb9PbLbUrG86","Featured":false,"Bio":"Andrew Haigh is an English filmmaker. He is best known for writing and directing the films Weekend, 45 Years, Lean on Pete, and All of Us Strangers. He also wrote and produced the HBO series Looking and its film sequel Looking: The Movie, as well as the BBC Two limited series The North Water. He splits his time between the U.K. and Los Angeles."}
{"_id":{"$oid":"65de18b59577bc2b6e8413c3"},"Title":"Looking","Description":"Patrick returns to San Francisco in search of closure and resolution regarding his relationships with Richie and Kevin.","Genre":{"Name":"Drama","Description":"A genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"Andrew Haigh","Bio":"Andrew Haigh is an English filmmaker. He is best known for writing and directing the films Weekend, 45 Years, Lean on Pete, and All of Us Strangers. He also wrote and produced the HBO series Looking and its film sequel Looking: The Movie, as well as the BBC Two limited series The North Water.","Birth":1973},"ImageURL":"https://images.app.goo.gl/5cEGDDKqxCJ7wEHr9","Featured":false,"Bio":"Andrew Haigh is an English filmmaker. He is best known for writing and directing the films Weekend, 45 Years, Lean on Pete, and All of Us Strangers. He also wrote and produced the HBO series Looking and its film sequel Looking: The Movie, as well as the BBC Two limited series The North Water. He splits his time between the U.K. and Los Angeles."}
{"_id":{"$oid":"65de18e09577bc2b6e8413c4"},"Title":"Princess Mononoke","Description":"On a journey to find the cure for a Tatarigami's curse, Ashitaka finds himself in the middle of a war between the forest gods and Tatara, a mining colony. In this quest he also meets San, the Mononoke Hime.","Genre":{"Name":"Fantasy","Description":"A genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds. The genre is considered a form of speculative fiction alongside science fiction films and horror films, although the genres do overlap. Fantasy films often have an element of magic, myth, wonder, escapism, and the extraordinary."},"Director":{"Name":"Hayao Miyazaki","Bio":"Hayao Miyazaki is a Japanese animator, filmmaker, and manga artist. A co-founder of Studio Ghibli, he has attained international acclaim as a masterful storyteller and creator of Japanese animated feature films, and is widely regarded as one of the most accomplished filmmakers in the history of animation.","Birth":1941},"ImageURL":"https://images.app.goo.gl/dNdQw2ecmp7MmXpUA","Featured":false}
